subject_1 = {
    'course_1': {
        'Matan1': '🫠Матан',
        'Angem': '🦎Ангем🦎',
        'GenPhys1': '😮Общефиз👈😮',
        'Python': '🐍Python',
    },
    'course_2': {
        'Matan3': '✨Матан✨',  # продва+база
        'Anmech': '🚬😔Анмех',  # продва+база
        'Diffeq': '🤟Диффуры🤟',
        'GenPhys3': '🪄Общефиз',
        'C++2': '🤓C++💻',
        'PhobTh': '👽Теорвер👽'
    },
    'course_3': {
        'KvantmechK': 'Квантмех(К)',
        'KvantmechA': 'Квантмех(А)',
        'KvantmechT': 'Квантмех(Т)',
        'TFKP': 'ТФКП',
        'Vychmaty': 'Вычматы',
        'GenPhys5': 'Общефиз',
        'UrmatyL': 'Урматы(Л)',
        'UrmatyK': 'Урматы(К)'
    }
}

subject_2 = {
    'course_1': {
        'Matan2': '🫠Матан',
        'Linal': '🦎Линал🦎',
        'GenPhys2': '🪄Общефиз',
        'C++1': '🤓C++💻'
    },
    'course_2': {

    },
    'course_3': {

    }
}